tests/load-test-simple.yml
# THE HIVE OS V5 - Load Testing Configuration (Simplified)
config:
  target: "http://localhost:3457"
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Warmup"
    - duration: 120
      arrivalRate: 10
      name: "Sustained Load"
    - duration: 60
      arrivalRate: 50
      name: "Spike"
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./load-test-helpers.js"

scenarios:
  # Chat AI Agents
  - name: "Chat with AI Agents"
    weight: 30
    flow:
      - function: "generateAuthToken"
      - post:
          url: "/api/chat"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            projectId: "{{ projectId }}"
            message: "Analyse les performances de ma campagne Meta Ads"
            agentId: "sora"
            sessionId: "{{ sessionId }}"
      - think: 2

  # Board View
  - name: "Board View Load"
    weight: 25
    flow:
      - function: "generateAuthToken"
      - get:
          url: "/api/projects/{{ projectId }}/board"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - think: 1

  # Files List
  - name: "Files List Load"
    weight: 20
    flow:
      - function: "generateAuthToken"
      - get:
          url: "/api/projects/{{ projectId }}/files"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - think: 1

  # Analytics Data
  - name: "Analytics Data Load"
    weight: 15
    flow:
      - function: "generateAuthToken"
      - post:
          url: "/api/analytics/fetch"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            projectId: "{{ projectId }}"
            source: "ga4"
            dateRange:
              start: "2026-04-01"
              end: "2026-04-28"
              preset: "30d"
      - think: 2

  # Genesis Project
  - name: "Genesis Project Creation"
    weight: 10
    flow:
      - function: "generateAuthToken"
      - post:
          url: "/api/genesis"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            projectName: "Load Test Campaign {{ $randomNumber() }}"
            brandName: "Test Brand"
            objectives: ["awareness", "conversion"]
            platforms: ["meta_ads", "google_ads"]
      - think: 3